fun main() {
    val tests = listOf(
        "2026-3-10",
        "عايزة افكرك 2026-03-25",
        "2025 / Dec / 10",
        "2025-Dec-10",
        "25 يناير",
        "25 Dec",
        "٢٠٢٥-يناير-١٥",
        "الامتحان 25/3",
        "2025 ديسمبر 10",
        "١٢ يوليو",

         "من يوم الاحد ليوم الثلاثاء",
        "من الخميس للأحد",
        "من يناير ٢٥ ل فبراير ١٠",
        "من يوم الاحد الجاي للثلاثاء بعد الجاي",
        "من 5/3 الى 7/3",

        "كل يوم جمعة",
        "كل جمعة",
        "كل أحد",

        "الشهر اللي جاي",
        "الاسبوع بعد الجاي",
        "الشهر القادم",
        "اول الشهر الجاي",
        "بداية الاسبوع الجاي",
        "منتصف الاسبوع اللي جاي",
        "آخر الأسبوع بعد الجاي",
        "اول الشهر",
        "بداية الاسبوع",
        "اول الاسبوع",
        "بداية الشهر",

        "الأحد الجاي",
        "الجمعة القادمة",
        "يوم الثلاثاء الجاي",


        "احد القادم",
        "بعد يومين",
        "بعد ٣ ايام",
        "كمان يوم واحد",
        "بعد تلات اسابيع",
        "بعد ثلاث ايام",
        "بعد ٥ شهور",
        "بعد كمان شهر",

        "بكره",
        "بعد بكره",
        "بعد غد",
        "غد",
        "بعد كمان يوم"

    )

    val Tmptests = listOf(
        "بعد كمان شهر"
    )
    for (t in tests) {
        println("$t -> ${TemporalParser.parse(t)}")
    }
}
