fun main() {
    val tests = listOf(
        "2026-3-10",
        "عايزة افكرك 2026-03-25",
        "2025 / Dec / 10",
        "2025-Dec-10",
        "25 يناير",
        "25 Dec",
        "٢٠٢٥-يناير-١٥",
        "الامتحان 25/3",
        "2025 ديسمبر 10",
        "١٢ يوليو",

         "من يوم الاحد ليوم الثلاثاء",
        "من الخميس للأحد",
        "من يناير ٢٥ ل فبراير ١٠",
        "من يوم الاحد الجاي للثلاثاء بعد الجاي",
        "من 5/3 الى 7/3",

        "كل يوم جمعة",
        "كل جمعة",
        "كل أحد",

        "الشهر اللي جاي",
        "الاسبوع بعد الجاي",
        "الشهر القادم",
        "اول الشهر الجاي",
        "بداية الاسبوع الجاي",
        "منتصف الاسبوع اللي جاي",
        "آخر الأسبوع بعد الجاي",
        "اول الشهر",
        "بداية الاسبوع",
        "اول الاسبوع",
        "بداية الشهر",

        "الأحد الجاي",
        "الجمعة القادمة",
        "يوم الثلاثاء الجاي",


        "احد القادم",
        "بعد يومين",
        "بعد ٣ ايام",
        "كمان يوم واحد",
        "بعد تلات اسابيع",
        "بعد ثلاث ايام",
        "بعد ٥ شهور",
        "بعد كمان شهر",

        "بكره",
        "بعد بكره",
        "بعد غد",
        "غد",
        "بعد كمان يوم"

    )



//    for (t in tests) {
//        println("$t -> ${TemporalParser.parse(t)}")
//    }

    val TimeTestCases = listOf(
        "بعد ربع ساعه",
        "كمان نص ساعه",
        "بعد ساعه و 20 دقيقة",
        "بعد ساعه و20 دقيقة",
        "بعد ساعه وعشرين دقيقة",
        "بعد ساعه و نص",
        "بعد ساعه ونص",
        " كمان ساعه",
        "تسعه وتلت بالليل",
        "١٠ وربع الصبح",
        "١١ الا ربع الصبح",
        " واحده وخمسه الضهر",
        "كمان اتنين و عشرين دقيقة",
        "٢ و 40 دقيقة صباحا",
        " 8 ونص الا خمسه العشا",
        "8 ونص وخمسه العشا",
        "تمانيه ونص الا خمسه العشاء",
        "نصايه",
        "ربعايه",
        "تلتايه",
        "ساعه كده",
        "اتنين الضهر",
        "خمسه العصر",
        "اربعة عصرا",
        "7 بالليل",
        "09:00",
        "10:00 مساء",
        "3:00 مساءا",
        "20:30",
        "اول اليوم",
        "بداية اليوم",
        "نص اليوم",
        "اخر اليوم",
        "بعد الضهر",
        "بعد العشاء",
        "بالليل",

    )
    val Tmptests = listOf(
        "20:30",
    )
    for (t in TimeTestCases) {
        println("$t -> ${TimeParser.parse(t)}")
    }
}
